---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.SizePrefix
source: html/24468d2e-1e90-8be7-07ca-b055788a19ea.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.SizePrefix Property

The size prefix string.

## Syntax (C#)
```csharp
public string SizePrefix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null